Console.WriteLine("Введите натуральное число ");
int x=Convert.ToInt32 ( Console.ReadLine()); 
int y = x % 10;
Console.WriteLine(y);

// Задача №7. Напишите программу, которая принимает на вход трёхзначное число
//  и на выходе показывает последнюю цифру этого числа. 	
//  456 -> 6 	782 -> 2 	918 -> 8